{
  "Kits":
  {
	"Brawler": {
	  "Knight": "Heal and gain a new set of soups for every takedown.",
	  "Fisherman": "Fisherman may teleport hooked enemies to them or may leap forward on marked location.",
	  "Bomber": "Bomber deals massive damage in an area with explosions.",
	  "Alpha": "Alpha becomes a lot more fierceful with the pack.",
	  "Viking": "Viking is a relentless force driven by rage, feared amongst everyone.",
	  "Basilisk": "Basilisk strives in long term battles poisoning opponents.",
	  "Warrior": "For every takedown Warrior is granted great buffs.",
	  "Shaman": "Shaman channels the spirit realm to enter spirit mode.",
	  "Vampire": "Vampire sustains by draining the lifeforce of weak opponents."
	},

    "Duelist": {
	  "Ninja": "Ninja is able to quickly position themselves behind their closest target in the blink of an eye.",
	  "Monkey": "Monkey is a trickster whom has mastered the art of confusion.",
	  "Hyper": "Hyper is insanely agile on their feet. Speed level increases in combat. Decreases after not hitting enemies.",
	  "Rogue": "A master of stealth may go completely invisible.",
	  "Slayer": "Slayer is unmatched in raw brutal strength therefore insanely scary to go up against.",
	  "Phoenix": "Phoenix is free to dash in any direction.",
	  "Challenger": "Challenger may weaken a soul until either one is vanquished.",
	  "Pirate": "Pirate thrives on collecting rewards and gold from plundering enemies."
	},

    "Ranged": {
	  "Inferno": "Inferno shoots flaming arrows that sets opponents ablaze on hit.",
	  "Scout": "Scout has withering arrows which denies healing.",
	  "Artillery": "Artillery has impeccable damage but has to be careful.",
	  "Snowman": "Snowman may throw snowballs rapidly to apply slowness while being quick on their feet."
	},

    "Tank": {
	  "Star": "Stars are forged with immense density emitting powerful darkness.",
	  "Dragon": "As the Dragon rises so does their flame breath.",
	  "Hedgehog": "Hedgehogs has extreme tankiness while gaining their resistances.",
	  "Juggernaut": "Juggernauts are massive usually being able to almost face tank anything."
	}
  }
}
