{
  "Kits":
  {
	"Brawler": {
	  "desc": "Monstrous fighters in battle that deal a lot damage.",

	  "Knight": "Knight replenishes their resources with each takedown.",
	  "Alpha": "Alpha becomes a lot more fierceful with the pack.",
	  "Viking": "Viking is a relentless force driven by rage, feared amongst everyone.",
	  "Basilisk": "Basilisk strives in long term battles poisoning opponents.",
	  "Warrior": "Warrior is blessed by the heavens after each takedown.",
	  "Slayer": "Slayer is unmatched in raw brutal strength.",
	  "Challenger": "Challenger may weaken a soul until either one is vanquished.",
	  "Shaman": "Shaman may enter spirit mode to gain advantage in combat.",
	  "Vampire": "Vampire sustains by draining the lifeforce of their opponents.",
	  "Alchemist": "Alchemist wield forbidden brews, using magical potions to gain the upper hand in battle."
	},
	
    "Duelist": {
	  "desc": "Specialises in aggressive playstyles to outplay an opponent.",

	  "Fisherman": "Fisherman may teleport hooked enemies to them or may leap forward on marked location.",
	  "Bomber": "Bomber causes devastating area damage with explosive attacks.",
	  "Ninja": "Ninja is able to quickly position themselves behind their target in the blink of an eye.",
	  "Monkey": "Monkey is a trickster whom has mastered the art of confusion.",
	  "Hyper": "Hyper is insanely agile on their feet.",
	  "Rogue": "Rogue is a master of stealth whom may go completely invisible.",
	  "Phoenix": "Phoenix soars unfettered, dashing with boundless freedom in any direction.",
	  "Pirate": "Pirate excels at plundering, earning gold and golden apples for each takedown."
	},

    "Ranged": {
	  "desc": "Damage opponents from afar whilst keeping your distance.",

	  "Inferno": "Inferno shoots flaming arrows that sets opponents ablaze on arrow hit.",
	  "Scout": "Scout is extremely dangerous due to withering arrows which suffocates healing.",
	  "Artillery": "Artillery has impeccable damage but has to be careful.",
	  "Snowman": "Snowman slows opponents and is quick on their feet."
	},

    "Tank": {
	  "desc": "Endure brutal amounts of unimaginable damage.",

	  "Star": "Star is forged with immense density emitting powerful darkness.",
	  "Dragon": "Dragon is a scary combatant whom blasts targets aflame in an area.",
	  "Hedgehog": "Hedgehog is extremely resiliant and shrugs damage off with ease.",
	  "Juggernaut": "Juggernaut is incredibly massive, being able to face tank anything.",
	  "Behemoth": "Behemoth is an ungodly titan, standing unbroken amidst the chaos."
	}
  }
}
