{
  "Kits":
  {
	"Brawler": {
	  "desc": "Brawlers are monstrous fighters in battle that deal a lot damage.",

	  "Knight": "Upon takedown, Knight fully heals and replenishes their set of soups.",
	  "Alpha": "Alpha becomes a lot more fierceful with the pack.",
	  "Viking": "Viking is a relentless force driven by rage, feared amongst everyone.",
	  "Basilisk": "Basilisk strives in long term battles poisoning opponents.",
	  "Warrior": "For every takedown Warrior is granted great buffs.",
	  "Slayer": "Slayer is unmatched in raw brutal strength.",
	  "Challenger": "Challenger may weaken a soul until either one is vanquished.",
	  "Shaman": "Shaman channels the spirit realm to enter spirit mode.",
	  "Vampire": "Vampire sustains by draining the lifeforce of their opponents."
	},
	
    "Duelist": {
	  "desc": "Specialises in aggressive playstyles to outplay an opponent.",

	  "Fisherman": "Fisherman may teleport hooked enemies to them or may leap forward on marked location.",
	  "Bomber": "Bomber causes devastating area damage with explosive attacks.",
	  "Ninja": "Ninja is able to quickly position themselves behind their closest target in the blink of an eye.",
	  "Monkey": "Monkey is a trickster whom has mastered the art of confusion.",
	  "Hyper": "Hyper is insanely agile on their feet.",
	  "Rogue": "A master of stealth may go completely invisible.",
	  "Phoenix": "Phoenix is free to dash in any direction.",
	  "Pirate": "Pirate excels at plundering, earning gold and golden apples for each takedown."
	},

    "Ranged": {
	  "desc": "Damage opponents from afar whilst keeping your distance.",

	  "Inferno": "Inferno shoots flaming arrows that sets opponents ablaze on arrow hit.",
	  "Scout": "Scout is extremely dangerous due to withering arrows which denies healing.",
	  "Artillery": "Artillery has impeccable damage but has to be careful.",
	  "Snowman": "Snowman slows opponents and are quick on their feet."
	},

    "Tank": {
	  "desc": "Endure brutal amounts of damage.",

	  "Star": "Stars are forged with immense density emitting powerful darkness.",
	  "Dragon": "Dragon blasts targets aflame in an area.",
	  "Hedgehog": "Hedgehogs are extremely resiliant and shrugs damage off with ease.",
	  "Juggernaut": "Juggernauts are massive, being able to face tank anything."
	}
  }
}
