{
  "Kits":
  {
	"Brawler": {
		"desc": "Brawlers are monstrous fighters in battle that deal a lot damage.",
		"type": "Melee",
		"icon": "Fire Charge",

	  "Knight": {
			"desc": "Heal and gain a new set of soups for every takedown.",
			"cost": 0,
			"icon": "Diamond Sword",
			"passive": true,
			"active": false,
			"passive_ability": "For every takedown you are healed to maximum health and refill your inventory with soups.",
			"active_ability": "No ability activation.",
			"details1": "If the refill variable is set higher than the inventory capacity, then refill to maximum inventory capacity.",
			"details2": "If the heal variable is set higher than the health capacity, then set health to maximum health capacity.",
			"refill": 16,
			"heal": 20
	  },
	  "Alpha": {
		  "desc": "Alpha becomes a lot more fierceful with the pack.",
		  "cost": 650,
		  "icon": "Bone",
		  "passive": false,
		  "active": true,
		  "passive_ability": "No passive ability.",
		  "active_ability": "Summon 6 wolves that attacks your last hit target.",
		  "details1": "While the ability is active, both you and your wolves gain speed 1 during the duration of the ability.",
		  "details2": "The wolves should be able to damage themselves from the Hedgehog passive ability. (20hp * 0.10% pre-mitigation max health dmg = 2hp | 2/2 = 1 heart.)",
		  "cooldown": 35,
		  "duration": 15,
		  "wolves_amount": 6,
		  "wolf_max_health": 20,
		  "wolf_health": 20,
		  "wolf_damage": 0.1,
		  "speed_strength": 1,
		  "speed_duration": 15
	  },
	  "Viking": {
		  "desc": "Viking is a relentless force driven by rage, feared amongst everyone.",
		  "cost": 650,
		  "icon": "Diamond Axe",
		  "passive": true,
		  "active": true,
		  "passive_ability": "Weakens opponents for every 20th hit onto you for 6 seconds.",
		  "active_ability": "Summon a lightning bolt on the selected target and deal 50% of their current health as pre-mitigation damage and set opponent ablaze for 8 seconds.",
		  "details1": "The weakness applies onto the enemies after the enemies have hit Viking 20 times, the weakness application caps at Weakness 10.",
		  "cooldown": 40,
		  "amount_of_hits": 20,
		  "weakness_strength": 1,
		  "weakness_duration": 6,
		  "lightning_damage": 0.5,
		  "ignition_duration": 8
	  },
	  "Basilisk": {
		  "desc": "Basilisk strives in long term battles poisoning opponents.",
		  "cost": 650,
		  "icon": "Fermented Spider Eye",
		  "passive": true,
		  "active": false,
		  "passive_ability": "Every 10th hit poison enemies for 3 seconds and grants you speed 1 for the same duration.",
		  "active_ability": "No ability activation.",
		  "details1": "Whilst the enemy is poisoned, antiheal is applied, halve the health restoration from soups for the duration of the poison.",
		  "details2": "Hits should be registered hits, not hits that was blocked by the hit delay cooldown that only shows particles.",
		  "amount_of_hits": 10,
		  "poison_strength": 4,
		  "poison_duration": 3,
		  "speed_strength": 1,
		  "speed_duration": 3,
		  "antiheal_percentage": 2,
		  "antiheal_duration": 3
	  },
	  "Warrior": {
		  "desc": "For every takedown Warrior is granted great buffs.",
		  "cost": 1252,
		  "icon": "Diamond Helmet",
		  "passive": true,
		  "active": false,
		  "passive_ability": "For every takedown you are granted strength 1, speed 1, resistance 1 and regeneration 3 for 6 seconds.",
		  "active_ability": "No ability activation.",
		  "details1": "The great buffs resets on takedown, it does not stack, also gain protection 1 on your helmet.",
		  "details2": "Immune to all negative effects during great buffs.",
		  "great_buffs": {
			"increase_damage_strength": 1,
			"speed_strength": 1,
			"resistance_strength": 1,
			"regeneration_strength": 3
		  },
		  "great_buffs_duration": 6
	  },
	  "Slayer": {
		"desc": "Slayer is unmatched in raw brutal strength.",
		"cost": 1650,
		"icon": "Blaze Powder",
		"passive": true,
		"active": true,
		"passive_ability": "Restores 1 heart when successfully landing a critical strike.",
		"active_ability": "Grants 2 additional levels of sharpness on the sword for 10 seconds.",
		"details1": "The critical strike should only be registered critical strike hits, and NOT unsuccessful hits that shows particles and does not hurt the opponent because of the hit delay cooldown.",
		"cooldown": 70,
		"duration": 10,
		"restoration": 2,
		"additional_sharpness_level": 2,
		"additional_sharpness_duration": 10
	  },
	  "Challenger": {
		"desc": "Challenger may weaken a soul until either one is vanquished.",
		"cost": 1650,
		"icon": "Glowstone Dust",
		"passive": false,
		"active": true,
		"passive_ability": "If the Challenger successfully kills their target, their weapon will deal pre-mitigation damage for 7 seconds",
		"active_ability": "You weaken your selected target until either one of you dies, all current effects will be removed from both players.",
		"details1": "If either one dies, the weakness effect is removed from the selected target and respective effects removed will be restored.",
		"details2": "Cooldown will not begin to count down until either of you have been slain.",
		"details3": "Cannot remove Great Buffs from Warrior.",

		"easteregg1": "If Challenger kills Warrior, Challenger is granted Great Buffs for 12 seconds.",
		"easteregg2": "If Challenger kills Slayer, Challenger is granted an additional sharpness level on their weapon permanently.",
		"easteregg1_reverse": "If Warrior kills Challenger, Warrior is granted Great Buffs for 12 seconds instead of 6.",
		"easteregg2_reverse": "If Slayer kills Challenger, Slayer is granted an additional sharpness level on their weapon permanently.",
		"easteregg_rule": "Permanent Easter Eggs can only be done once for every Challenger.",

		"cooldown": 120,
		"weakness_strength": 1,
		"weakness_duration": 99999,
		"excalibur_damage_duration": 7
	  },
	  "Shaman": {
		"desc": "Shaman channels the spirit realm to enter spirit mode.",
		"cost": 1650,
		"icon": "Ghast Tear",
		"passive": true,
		"active": true,
		"passive_ability": "Heal 20% of damage dealt post-mitigation and reduce all incoming damage by 1 heart.",
		"active_ability": "You slow your target and steal all enchantments and positive effects from your target.",
		"details1": "Does not steal negative effects from target.",
		"details2": "Puts ability on cooldown even if the target has nothing to steal, since slow is still applied.",
		"details3": "Effects stolen does not expire, only restored by exiting spirit mode.",
		"details4": "Refresh the duration of spirit mode by hitting a player.",
		"details5": "Shaman is unable to steal Great Buffs from Warrior.",
		"details6": "Cooldown will start when the duration has ended.",
		"cooldown": 80,
		"duration": 4,
		"heal": 0.20,
		"damage_mitigation": 2,
		"slow_strength": 3,
		"slow_duration": 10
	  },
	  "Vampire": {
		"desc": "Vampire sustains by draining the lifeforce of weak opponents.",
		"cost": 1650,
		"icon": "Rose Red",
		"passive": true,
		"active": true,
		"passive_ability": "Gain speed for every drain. Damage and health restoration is doubled at or under 4 hearts.",
		"active_ability": "Drains health from the selected target and heals you for the same amount.",
		"details1": "Damage and health restoration is doubled when the selected target is at or under 4 hearts.",
		"details2": "Will not spawn with any soups and also cannot use soups to restore health and can neither can access soup signs to refill.",
		"details3": "Drain damage is pre-mitigation damage.",
		"cooldown": 0.5,
		"drain_damage": 4,
		"drain_heal": 4,
		"empowered_drain_damage": 8,
		"empowered_drain_heal": 8,
		"speed_strength": 2,
		"speed_duration": 4
	  }
	},

    "Duelist": {
		"desc": "Specialises in aggressive playstyles to outplay an opponent.",
		"type": "Melee",
		"icon": "Diamond Sword",

	  "Fisherman": {
		  "desc": "Fisherman may teleport hooked enemies to them or may leap forward on marked location.",
		  "cost": 850,
		  "icon": "Fishing Rod",
		  "passive": false,
		  "active": true,
		  "passive_ability": "No passive ability.",
		  "active_ability": "Teleports hooked players to your location or leap forward.",
		  "details1": "Teleported players will be facing the direction you are facing when teleporting them.",
		  "details2": "Projectile protection 10, feather falling 2.",
		  "cooldown": 7
	  },
	  "Bomber": {
		  "desc": "Bomber deals massive damage in an area with explosions.",
		  "cost": 850,
		  "icon": "TNT",
		  "passive": true,
		  "active": false,
		  "passive_ability": "Placing TNT detonates instantly.",
		  "active_ability": "No ability activation.",
		  "details1": "Spawns with 16 TNT, they cannot destroy terrain.",
		  "details2": "Grant 8 TNT for every takedown with a cap of 64.",
		  "details3": "Bomber is granted Blast Protection 10 on boots.",
		  "radius": 5,
		  "explosion_damage": 4,
		  "explosion_knockback": "Vanilla"
	  },
	  "Ninja": {
		  "desc": "Ninja is able to quickly position themselves behind their target in the blink of an eye.",
		  "cost": 850,
		  "icon": "Slime",
		  "passive": true,
		  "active": true,
		  "passive_ability": "After teleporting, you dodge all incoming attacks and projectiles for 1 seconds.",
		  "active_ability": "SHIFT to Teleport 1 block behind your last hit target or closest target.",
		  "details1": "The ability should not be put on cooldown if no one is in range.",
		  "details2": "Spawns with 8 enderpearls, every takedown grants a new enderpearl with a cap of 8.",
		  "details3": "Enderpearls does not exclude passive from being applied.",
		  "details4": "Enderpearl shall override any item to avoid player exploitation.",
		  "details5": "Ninja is granted Feather Falling 10 on boots.",
		  "cooldown": 11,
		  "enderpearl_cooldown": 4,
		  "radius": 8,
		  "dodge_duration": 1
	  },
	  "Monkey": {
		"desc": "Monkey is a trickster whom has mastered the art of confusion.",
		"cost": 850,
		"main_icon1": "Blaze Rod",
		"icon2": "Beacon",
		"icon3": "Paper",
		"passive": false,
		"active": true,
		"passive_ability": "No passive ability.",
		"active_ability1": "Change opponents currently held item to another slot in their hotbar.",
		"active_ability2": "Swap health with your opponent.",
		"active_ability3": "Become invisible for 4 seconds.",
		"details1": "If Monkey swaps more health than his maximum health can hold, Monkey will have his current health set to his maximum health. This avoids gaining effect bonuses.",
		"details2": "Regular invisibility effect, not vanished like Rogue, therefore can still be hit during the duration of the ability.",
		"details": "Projectile Protection 8 on Leggings.",
		"active_ability1_cooldown": 5,
		"active_ability2_cooldown": 20,
		"active_ability3_cooldown": 10,
		"invisibility_duration": 4
	  },
	  "Hyper": {
		  "desc": "Hyper is insanely agile on their feet.",
		  "cost": 1250,
		  "icon": "Feather",
		  "passive": true,
		  "active": false,
		  "passive_ability": "Speed level increases for every 3rd hit with a cap of level 6 and decreases back to level 2 after 4 seconds of not hitting any players.",
		  "active_ability": "No ability activation.",
		  "details1": "Does NOT stack with mobs, ONLY players, the hit should be a successful registered hit, and not a hit that was blocked because of the hit delay cooldown that only shows particles.",
		  "base_speed": 2,
		  "base_speed_duration": 99999,
		  "bonus_speed_level": 1,
		  "bonus_speed_duration": 4,
		  "speed_cap": 6
	  },
	  "Rogue": {
		  "desc": "A master of stealth may go completely invisible.",
		  "cost": 1250,
		  "icon": "Paper",
		  "passive": false,
		  "active": true,
		  "passive_ability": "No passive ability.",
		  "active_ability": "Go completely invisible/vanish for 8 seconds, while invisible your attacks deal bonus damage of the target's missing health, you also gain speed 2 for the duration you are invisible.",
		  "details1": "Should be rendered invisible, cannot be seen by any particles or projectiles, therefore cannot be hit themselves until the duration runs out.",
		  "details2": "Can still damage themselves from Hedgehog passive ability.",
		  "cooldown": 60,
		  "invisible_duration": 8,
		  "speed_strength": 2,
		  "speed_duration": 8,
		  "%missing_health_damage": 0.25,
		  "%missing_health_damage_duration": 8
	  },
	  "Phoenix": {
		  "desc": "Phoenix is free to dash forwards in any direction.",
		  "cost": 1650,
		  "icon": "Magma Cream",
		  "passive": true,
		  "active": true,
		  "passive_ability": "Grants 2 hearts of absorption for every dash for 3 seconds.",
		  "active_ability": "Dash/launch forwards with SHIFT",
		  "details1": "May not launch themselves upwards or downwards if applicable.",
		  "active_cooldown": 8,
		  "launch_amount": 5,
		  "absorption_health": 4,
		  "absorption_duration": 3
	  },
	  "Pirate": {
		"desc": "Pirate thrives on collecting rewards and gold from plundering enemies.",
		"cost": 1650,
		"icon": "Gold Ingot",
		"passive": true,
		"active": true,
		"passive_ability": "For every takedown you are granted double gold and 3 golden apples.",
		"active_ability": "Consuming a golden apple will cleanse all debuffs and be immune to abilities for 3 seconds.",
		"duration": 3
	  }
	},

    "Ranged": {
		"desc": "Damage opponents from afar whilst keeping your distance.",
		"type": "Ranged",
		"icon": "Bow",

	  "Inferno": {
		  "desc": "Inferno shoots flaming arrows that sets opponents ablaze on hit.",
		  "cost": 1650,
		  "icon": "Bow",
		  "passive": true,
		  "active": false,
		  "passive_ability": "Every third arrow ignites an opponent for 6 seconds if hit.",
		  "active_ability": "No ability activation.",
		  "ignite_duration": 6
	  },
	  "Scout": {
		  "desc": "Scout has withering arrows which denies healing.",
		  "cost": 1650,
		  "icon": "Chain Helmet",
		  "passive": true,
		  "active": false,
		  "passive_ability": "Every third hit on the same target applies wither effect.",
		  "active_ability": "No ability activation.",
		  "details1": "Whilst the enemy is withered, antiheal is applied, all health restoration from soups is denied for the duration of the wither.",
		  "details": "Permanent Speed 1",
		  "amount_of_hits": 3,
		  "wither_strength": 3,
		  "wither_duration": 2,
		  "speed_strength": 1,
		  "speed_duration": 99999,
		  "antiheal_percentage": 100,
		  "antiheal_duration": 1
	  },
	  "Artillery": {
		  "desc": "Artillery has impeccable damage but has to be careful.",
		  "cost": 2650,
		  "icon": "Arrow",
		  "passive": true,
		  "active": false,
		  "passive_ability": "Get one arrow every 5 seconds, only if you don't have one already.",
		  "active_ability": "No ability activation.",
		  "details1": "Refund the arrow if a player was hit.",
		  "arrow_cooldown": 5
	  },
	  "Snowman": {
		  "desc": "Snowman may throw snowballs rapidly to apply slowness while being quick on their feet.",
		  "cost": 2650,
		  "icon": "Snowball",
		  "passive": true,
		  "active": false,
		  "passive_ability": "You are granted speed and your snowballs deals 1.5 hearts of pre-mitigation damage, applying slowness 1 on opponents for 1 second.",
		  "active_ability": "No ability activation.",
		  "details1": "Replenish 16 snowballs when you run out of them by using your last snowball.",
		  "details2": "Spawns with 16 snowballs and cannot gain more than 16 snowballs from replenishes.",
		  "snowball_damage": 3,
		  "speed_strength": 1,
		  "speed_duration": 99999,
		  "slowness_strength": 1,
		  "slowness_duration": 1
	  }
	},

    "Tank": {
		"desc": "Endure brutal amounts of damage.",
		"type": "Melee",
		"icon": "Diamond Chestplate",

	  "Star": {
		  "desc": "Stars are forged with immense density emitting powerful darkness.",
		  "cost": 1650,
		  "icon": "Nether Star",
		  "passive": true,
		  "active": true,
		  "passive_ability": "Apply a strong slowness and blindness every 30th hit for 5 seconds.",
		  "active_ability": "Stun nearby players in a radius of 5 blocks for 3 seconds, if at least one player is stunned, restore full health.",
		  "details1": "The stunned players may not be able to move at all, however they should be able to freely move their direction they are facing and still damage nearby players.",
		  "details2": "Do not restore any health if nobody was stunned in the area, and put the ability on cooldown.",
		  "details3": "Health boost 14, slowness 1",
		  "details4": "Do not restore health if Pirate was immune, will still restore health if Pirate cleanses it afterwards, since the stun is applied first.",
		  "cooldown": 45,
		  "slowness_strength": 2,
		  "slowness_duration": 5,
		  "blind_strength": 1,
		  "blindness_duration": 5,
		  "stun_radius": 5,
		  "stun_duration": 3
	  },
	  "Dragon": {
		  "desc": "Dragon blasts targets aflame in an area.",
		  "cost": 1650,
		  "icon": "Fire Charge",
		  "passive": true,
		  "active": true,
		  "passive_ability": "Nearby opponents are dealt 5% max health pre-mitigation damage every second.",
		  "active_ability": "Blasts enemies in a radius of 8 blocks to deal 4 hearts of pre-mitigation damage and also ignites blasted opponents for 4 seconds.",
		  "details1": "Dragon should have fire resistance 1.",
		  "cooldown": 40,
		  "passive_radius": 4,
		  "passive_damage": 0.05,
		  "active_radius": 8,
		  "blast_damage": 8,
		  "ignite_duration": 4
	  },
	  "Hedgehog": {
		  "desc": "Hedgehogs are extremely resiliant and shrugs damage off with ease.",
		  "cost": 2650,
		  "icon": "Nether Brick",
		  "passive": true,
		  "active": true,
		  "passive_ability": "Thorn 50% of the opponents pre-mitigated melee damage back to the opponent.",
		  "active_ability": "Gain resistance 2 for 8 seconds.",
		  "details1": "Does not thorn projectile damage only melee damage.",
		  "cooldown": 20,
		  "passive_thorn": 0.5,
		  "resistance_strength": 2,
		  "resistance_duration": 8
	  },
	  "Juggernaut": {
		  "desc": "Juggernauts are able to face tank anything.",
		  "cost": 2650,
		  "icon": "Orange Dye #351:14",
		  "passive": true,
		  "active": true,
		  "passive_ability": "Increase health by 2 hearts every takedown.",
		  "active_ability": "Gain regeneration 5 for 10 seconds with a cooldown of 50 seconds.",
		  "details1": "Starts with slowness 1 and 3 rows of hearts via health boost effect and instantly healed.",
		  "details2": "Health boost stacking using Health boost effect.",
		  "details3": "For every takedown, the player is instantly healed to the new current max health.",
		  "details4": "When active_ability is active, slowness is removed for the duration.",
		  "cooldown": 50,
		  "additional_health_boost_per_kill": 1,
		  "regeneration": 5,
		  "regeneration_duration": 10
	  }
	}
  }
}
